{
  "replaces": {},
  "reflections": {
    "am":     "are",
    "was":    "were",
    "i":      "you",
    "i'd":    "you would",
    "i've":   "you have",
    "i'll":   "you will",
    "my":     "your",
    "are":    "am",
    "you've": "I have",
    "you'll": "I will",
    "your":   "my",
    "yours":  "mine",
    "you":    "me",
    "me":     "you"
  },
  "patterns": [
    ["^$"],
    ["hello|hi"],
    ["quit"],

    ["i need (.*)"],

    ["[what|explain|how](.*) (PH|ph|Ph)(.*)"],
    ["[what|explain|how](.*) (kh|KH|kh)(.*)"],
    ["[what|explain|how](.*) (gh|GH|Gh)(.*)"],
    ["[what|explain|how](.*) (tds|TDS)(.*)"],
    ["[what|explain|how](.*) temperature(.*)"],
    ["[what|explain|how](.*) (calcium|Ca|CA|ca)(.*)"],
    ["[what|explain|how](.*) (magnesium|Mg|MG|mg)(.*)"],

    ["[what|explain|how](.*) [relation|between](.*) magnesium(.*) calcium",
    "[what|explain|how](.*) [relation|between](.*) calcium(.*) magnesium"],
    ["[what|explain|how](.*) [relation|between](.*) calcium(.*) kh",
    "[what|explain|how](.*) [relation|between](.*) kh(.*) calcium"],
    ["[what|explain|how](.*) [relation|between](.*) ph(.*) kh",
    "[what|explain|how](.*) [relation|between](.*) kh(.*) ph"],

    ["(.*)[?]"],
    ["(.*)"]
  ],
  "answers": [
    ["i can't answer empty questions..."],
    ["hi! what do you need from this humble chatbot? :D"],
    ["ok, see you soon, bye! :D",
      "thank you for talking with me"],
    ["what?"],

    ["PH is a measure of how acidic or basic water is, ranging from 0 to 14. In an aquarium, pH is crucial as it affects fish health and the biological and chemical processes in the water. Different fish species thrive at different pH levels; freshwater aquariums typically have a pH of 6.5 to 7.5, while saltwater aquariums prefer a pH of 8.1 to 8.4. Sudden changes in pH can stress fish, leading to illness or death. pH affects the toxicity of substances like ammonia and the efficiency of biological filtration. Regular monitoring and maintenance of the correct pH level are essential for a healthy aquarium environment. More acid water means more reactive water (dilute nutrients and minerals) and more alkalin water mean less reactive (more sedimentation of nutrients and minerals, specialy minerals). The PH have a close relationship with another parameters and cycles of the aquarium, for example, the parameter KH is very close related to PH, since KH measure water carbonates and these molecules can neutralize acid substances in the water. Another important relation is calcium, since calcium can easy sediment, more acid water can dilute and \"absorb\" more calcium."],
    ["KH, or carbonate hardness, measures the concentration of carbonate and bicarbonate ions in water, acting as a buffer that stabilizes pH levels by neutralizing acids. In an aquarium, maintaining a proper KH level is crucial because it prevents sudden pH swings that can stress or harm animals and plants. A higher KH means greater buffering capacity, making it easier to maintain a stable pH. Because of the carbonates and bicarbonates, KH is very important to invertebrates like: shrimps, snails, lobsters and corals, low KH may cause death to this animals. KH is also related to calcium levels, especially in saltwater aquariums, where calcium carbonate contributes to both KH and calcium concentration. In freshwater aquariums, KH levels typically range from 4 to 8 dKH (degrees of carbonate hardness), while in saltwater aquariums, a KH of 8 to 12 dKH is preferred. Proper KH levels ensure a stable environment, aiding in fish health and the overall biological balance of the aquarium. Regular testing and adjustments are necessary to maintain appropriate KH levels, often achieved through water changes or using buffers."],
    ["GH, or general hardness, measures the concentration of calcium and magnesium ions in water, indicating the overall mineral content. In an aquarium, GH is important for the growth and health of fish and plants, as it affects biological functions like bone development and enzyme activity. While KH (carbonate hardness) measures the water's buffering capacity and stability of pH, GH does not directly influence pH but rather the hardness and softness of the water. Proper GH levels vary depending on the species kept, with freshwater aquariums generally requiring 4 to 8 dGH (degrees of general hardness) and saltwater aquariums preferring higher levels. Regular testing and adjustments are necessary to maintain appropriate GH levels, often achieved through water changes or using mineral supplements. Maintaining both GH and KH within the suitable range ensures a healthy and stable environment for aquarium inhabitants."],
    ["TDS, or Total Dissolved Solids, measures the total concentration of dissolved substances in water, including minerals, salts, and organic matter. In an aquarium, TDS is an important parameter because it GIVES AN OVERTALL INDICATION OF WATER QUALITY. TDS is related to GH (general hardness) and KH (carbonate hardness) because both contribute to the total concentration of dissolved minerals. GH measures the concentration of calcium and magnesium ions, while KH measures the concentration of carbonate and bicarbonate ions. High TDS levels can indicate hard water, with high GH and KH, while low TDS levels usually mean soft water, with lower GH and KH. Maintaining appropriate TDS levels is crucial for the health of fish and plants, as sudden changes can cause stress or harm. Regular testing and adjustments are necessary to maintain the suitable TDS levels, often achieved through water changes, using RO (reverse osmosis) water, or adding specific minerals. Keeping TDS within the appropriate range helps ensure a stable and healthy environment in the aquarium."],
    ["Temperature is a critical parameter in an aquarium as it affects the metabolism, immune system, and overall health of fish and other aquatic organisms. Most freshwater tropical fish thrive in temperatures between 75-80°F (24-27°C), while marine fish prefer slightly warmer waters around 78-82°F (25-28°C). Temperature stability is just as important as the actual temperature range, as sudden fluctuations can stress fish, leading to illness or death. Heaters and thermometers are essential tools for maintaining a stable temperature. It's important to place the heater near water flow to ensure even heat distribution. In warmer climates or for certain species, a chiller might be needed to keep the water cool. Regular monitoring and adjustment of the aquarium temperature help provide a stable and comfortable environment for all inhabitants."],
    ["Calcium is a vital mineral in aquariums, crucial for the health of fish, invertebrates, and plants. It plays a significant role in the development of bones, shells, and overall cellular function. Calcium levels are a component of GH (general hardness), which measures the concentration of calcium and magnesium ions in the water. GH affects the overall mineral content and water hardness, influencing the health and growth of aquatic organisms. Calcium also has an important relationship with KH (carbonate hardness), as calcium carbonate contributes to both calcium levels and the buffering capacity of the water. Proper KH levels help stabilize pH by neutralizing acids, preventing sudden pH swings that can harm aquarium inhabitants. In saltwater aquariums, the balance between calcium and magnesium is particularly important, as both are essential for the growth of corals and other marine invertebrates. Magnesium helps to stabilize calcium levels and prevents excessive calcium precipitation, which can otherwise deplete available calcium in the water. Maintaining the right balance of calcium is essential for a stable and healthy aquarium environment, often achieved through regular testing and adjustments using calcium supplements or water changes. Ensuring appropriate calcium levels supports the overall hardness and buffering capacity of the water, promoting the well-being of all aquarium life."],
    ["Magnesium is a crucial mineral in aquariums, particularly in saltwater setups, where it plays an essential role in the health of fish, corals, and other invertebrates. It is a component of GH (general hardness), which measures the concentration of calcium and magnesium ions in the water. GH affects the overall mineral content and water hardness, influencing the well-being and growth of aquatic organisms. Magnesium has a very important relationship with calcium, especially in saltwater aquariums. It helps stabilize calcium levels by preventing calcium from precipitating out of the water, which ensures that calcium remains available for biological processes like skeletal formation in corals and shell building in invertebrates.\nIn addition to its role in preventing calcium precipitation, magnesium is involved in various biological functions, including photosynthesis in marine plants and algae. The proper balance of magnesium and calcium is vital for maintaining the health of corals and promoting the growth of coral reefs. Without adequate magnesium, calcium levels can drop too low, leading to issues with coral growth and stability.\nRegular testing and adjustments are necessary to maintain appropriate magnesium levels, often achieved through the use of magnesium supplements or specific salt mixes designed for marine aquariums. Ensuring the correct balance of magnesium supports the overall hardness and buffering capacity of the water, contributing to a stable and healthy environment for all aquarium inhabitants."],
    
    ["Magnesium (Mg²⁺) and calcium (Ca²⁺) have a critical relationship in saltwater aquariums, especially for the health and growth of corals and other marine invertebrates. Calcium is essential for forming calcium carbonate (CaCO₃) skeletons and shells, with optimal levels typically ranging from 400 to 450 ppm (parts per million). Magnesium, usually maintained at levels of 1250 to 1350 ppm, stabilizes calcium and prevents its precipitation. The chemical reaction that illustrates calcium precipitation is: Ca²⁺ + CO₃²⁻ → CaCO₃ (solid). Magnesium interferes with this process, preventing calcium from forming insoluble compounds and remaining bioavailable. The ideal ratio of magnesium to calcium in saltwater aquariums is roughly 3:1. Maintaining this balance ensures that calcium is available for biological processes, promoting the growth and health of corals. Regular testing and adjustments using specific supplements are necessary to keep these levels within their optimal ranges, ensuring a stable and healthy marine environment."],
    ["KH, or carbonate hardness, measures the concentration of carbonate (CO₃²⁻) and bicarbonate (HCO₃⁻) ions in water, and it plays a crucial role in maintaining pH stability in saltwater aquariums. Calcium (Ca²⁺) is essential for forming calcium carbonate (CaCO₃) skeletons and shells. In saltwater aquariums, the relationship between KH and calcium is vital because KH buffers the water, preventing pH swings and facilitating calcium availability. The chemical equilibrium involved is: Ca²⁺ + 2HCO₃⁻ → CaCO₃ + CO₂ + H₂O. Optimal calcium levels are typically between 400 to 450 ppm (parts per million), while KH levels are maintained between 8 to 12 dKH (degrees of carbonate hardness).\n A higher KH stabilizes the pH, preventing the water from becoming too acidic or too alkaline, which would otherwise cause calcium precipitation, reducing its availability for biological processes. The proper proportion of KH and calcium ensures that calcium carbonate does not form too readily, which would remove calcium from the water and make it unavailable to corals and other organisms. Regular testing and adjustments using buffers and supplements are necessary to maintain these levels within their optimal ranges, promoting a stable and healthy marine environment."],
    ["KH, or carbonate hardness, measures the concentration of carbonate (CO₃²⁻) and bicarbonate (HCO₃⁻) ions in water, which act as buffers to maintain pH stability. The relationship between KH and pH is critical because KH prevents rapid changes in pH by neutralizing acids. The chemical equilibrium involved in buffering is: H⁺ + HCO₃⁻ ↔ H₂CO₃ ↔ CO₂ + H₂O. Optimal KH levels in aquariums are typically maintained between 4 to 8 dKH (degrees of carbonate hardness) for freshwater and 8 to 12 dKH for saltwater, which provides sufficient buffering capacity to keep the pH stable. \n The concentration and proportion of KH directly affect the pH. A higher KH means more carbonate and bicarbonate ions are available to neutralize acids, thus preventing the pH from dropping too quickly. Conversely, a lower KH provides less buffering capacity, making the pH more susceptible to fluctuations. For example, if the pH starts to drop due to the addition of an acid, the reaction H⁺ + HCO₃⁻ → H₂CO₃ occurs, where bicarbonate ions neutralize the excess hydrogen ions, forming carbonic acid which further breaks down into water and carbon dioxide, preventing a significant drop in pH. Regular testing and adjustments using KH buffers are necessary to maintain these levels within their optimal ranges, ensuring a stable and healthy environment. By maintaining proper KH levels, the pH remains stable, which is essential for the health and well-being of aquatic organisms."],
    
    ["Sorry, i can't find a pattern to that question on my database"],
    ["huuuum... can you be more specific?"]
  ]
}